iotsmartsys/IoTSmartSysCore/src/Platform/Espressif/Pinouts/ESP32_S3_Pinouts.h
#pragma once

#include "sdkconfig.h"

#if CONFIG_IDF_TARGET_ESP32S3


#define ESP32_GPIO0 0
#define ESP32_BOOT_PIN ESP32_GPIO0
// Safe GPIO pins for ESP32-S3 module
#define ESP32_SAFE_GPIO1 1
#define ESP32_SAFE_GPIO2 2
#define ESP32_SAFE_GPIO3 3
#define ESP32_SAFE_GPIO4 4
#define ESP32_SAFE_GPIO5 5
#define ESP32_SAFE_GPIO6 6
#define ESP32_SAFE_GPIO7 7
#define ESP32_SAFE_GPIO8 8
#define ESP32_SAFE_GPIO9 9
#define ESP32_SAFE_GPIO10 10
#define ESP32_SAFE_GPIO11 11
#define ESP32_SAFE_GPIO12 12
#define ESP32_SAFE_GPIO13 13
#define ESP32_SAFE_GPIO14 14
#define ESP32_SAFE_GPIO15 15
#define ESP32_SAFE_GPIO16 16
#define ESP32_SAFE_GPIO17 17
#define ESP32_SAFE_GPIO18 18
#define ESP32_SAFE_GPIO21 21
#define ESP32_SAFE_GPIO38 38
#define ESP32_SAFE_GPIO39 39
#define ESP32_SAFE_GPIO40 40
#define ESP32_SAFE_GPIO41 41
#define ESP32_SAFE_GPIO42 42

// LED pin definitions (if applicable). Ex. Board ESP32-S3-DevKitC-1 has an on-board LED on GPIO43; Officially Espressif AI
#define ESP32_LED_GREEN_GPIO43 43
#define ESP32_LED_BLUE_GPIO44 44

// I2C default pins
#define ESP32_SDA ESP32_SAFE_GPIO8
#define ESP32_SCL ESP32_SAFE_GPIO9

// ADC1 pins
#define ESP32_SAFE_ADC1_GPIO1 1
#define ESP32_SAFE_ADC1_GPIO4 4
#define ESP32_SAFE_ADC1_GPIO5 5
#define ESP32_SAFE_ADC1_GPIO6 6
#define ESP32_SAFE_ADC1_GPIO7 7
#define ESP32_SAFE_ADC1_GPIO8 8
#define ESP32_SAFE_ADC1_GPIO9 9
#define ESP32_SAFE_ADC1_GPIO10 10

// ADC2 pins
#define ESP32_ADC2_GPIO11 11
#define ESP32_ADC2_GPIO12 12
#define ESP32_ADC2_GPIO13 13
#define ESP32_ADC2_GPIO14 14
#define ESP32_ADC2_GPIO15 15
#define ESP32_ADC2_GPIO16 16
#define ESP32_ADC2_GPIO17 17
#define ESP32_ADC2_GPIO18 18

// UART default pins
#define ESP32_UART0_RX 44
#define ESP32_UART0_TX 43

#endif // ESP32_S3